04_OpenFoam/_Tut_02/OpenFOAMTeaching/JozsefNagy/simulationTemplates/steadyState/baseCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    "(inlet.*)"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.1;
    }
    "(outlet.*)"
    {
        type            zeroGradient;
    }
    "(wall.*)"
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
