04_OpenFoam/_Tut_02/OpenFOAMTeaching/JozsefNagy/simulationTemplates/steadyState/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.openfoam.com; www.openfoam.org    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

//x_min -6.06;
//x_max 8.08;

//y_min -2.02;
//y_max 2.02;

//z_min -10.1;
//z_max 6.06;

//n_x 14;
//n_y 4;
//n_z 14;

vertices
(
    ($x_min $y_min $z_min)
    ($x_max $y_min $z_min)
    ($x_max $y_max $z_min)
    ($x_min $y_max $z_min)
    ($x_min $y_min $z_max)
    ($x_max $y_min $z_max)
    ($x_max $y_max $z_max)
    ($x_min $y_max $z_max)
);

blocks ( hex (0 1 2 3 4 5 6 7) ($n_x $n_y $n_z) simpleGrading (1 1 1) );

edges ( );

boundary (
    defaultBoundary
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
            (3 7 6 2)
        );
    }
);

mergePatchPairs ( );


// ************************************************************************* //
